Tekla Open API Reference for Tekla Structures 2025
OBB.ShortestSegmentTo Method (LineSegment)
 Calculates the shortest LineSegment from OBB to the given LineSegment.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LineSegment ShortestSegmentTo(
	LineSegment lineSegment
)
Public Function ShortestSegmentTo (
	lineSegment As LineSegment
) As LineSegment
Parameters
lineSegment
Type: Tekla.Structures.Geometry3d.LineSegment
LineSegment to calculate against
Return Value
Type: LineSegment
Shortest LineSegment from OBB to the given LineSegment.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when null is assigned to the lineSegment parameter.
See Also
Reference
OBB Class
ShortestSegmentTo Overload
Tekla.Structures.Geometry3d Namespace